In [2]:
import pandas as pd
import numpy as np

In [3]:
#pandas operations
#conditional selection
#Access rows & col's
#Add & delete columns
#concatenation merging & joining dataframe
#handling missing values
#apply()

In [4]:
d={'USN':[100,101,102],
   'Name':['Jerry','tom','Neeti'],
   'Mobile':[99,88,77],
   'Marks':[30,35,40]}

In [5]:
std=pd.DataFrame(d)

In [6]:
std

   USN   Name  Mobile  Marks
0  100  Jerry      99     30
1  101    tom      88     35
2  102  Neeti      77     40

In [7]:
#DataFrame operation
std.head(2)
#head - displaying rows
#display all by default
#parameters passed, display rows as per para

   USN   Name  Mobile  Marks
0  100  Jerry      99     30
1  101    tom      88     35

In [8]:
std.columns
#list of columns in my df

Index(['USN', 'Name', 'Mobile', 'Marks'], dtype='object')

In [9]:
std.info()
#gives all the information about my df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   USN     3 non-null      int64
 1   Name    3 non-null      object
 2   Mobile  3 non-null      int64
 3   Marks   3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 224.0+ bytes

In [10]:
std.isnull()
#gives the boolean value of the df

     USN   Name  Mobile  Marks
0  False  False   False  False
1  False  False   False  False
2  False  False   False  False

In [11]:
std

   USN   Name  Mobile  Marks
0  100  Jerry      99     30
1  101    tom      88     35
2  102  Neeti      77     40

In [12]:
#access columns
std['USN']

0    100
1    101
2    102
Name: USN, dtype: int64

In [13]:
#access multiple columns
std[['USN','Marks','Mobile']]

   USN  Marks  Mobile
0  100     30      99
1  101     35      88
2  102     40      77

In [14]:
std

   USN   Name  Mobile  Marks
0  100  Jerry      99     30
1  101    tom      88     35
2  102  Neeti      77     40

In [25]:
#access rows
#it's only to access which name or anyother thing
std.iloc[1]["Name"]
#returns row

'tom'

In [16]:
std.loc[2]
#returns second row

USN         102
Name      Neeti
Mobile       77
Marks        40
Name: 2, dtype: object

In [17]:
std.loc[0]

USN         100
Name      Jerry
Mobile       99
Marks        30
Name: 0, dtype: object

In [18]:
std

   USN   Name  Mobile  Marks
0  100  Jerry      99     30
1  101    tom      88     35
2  102  Neeti      77     40

In [19]:
#conditional selection
std['Marks']<35
#this attribute returns the boolean value of the given df in the from of true or false

0     True
1    False
2    False
Name: Marks, dtype: bool

#if u what to see the df for the conditional selection

In [20]:
newdf=std['Marks']<35

In [21]:
std[newdf]

   USN   Name  Mobile  Marks
0  100  Jerry      99     30

In [22]:
#use it only name or any other columns
std[newdf]['Name']

0    Jerry
Name: Name, dtype: object

In [23]:
#multiple conditions
std[(std['Name']=='jerry')
    &(std['Marks']>20)]

Empty DataFrame
Columns: [USN, Name, Mobile, Marks]
Index: []

In [24]:
std[(std['USN']>100)]

   USN   Name  Mobile  Marks
1  101    tom      88     35
2  102  Neeti      77     40